# ExportFontTableIterator Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportFontTableIterator Class
Members See Also
---
An iterator to a set of font table.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public class ExportFontTableIterator : IEnumerator<KeyValuePair<ExportFontKey, ExportFontInfo>>
```

Visual Basic
---
```text
Public Class ExportFontTableIterator _
	Implements IEnumerator(Of KeyValuePair(Of ExportFontKey, ExportFontInfo))
```

Visual C++
---
```text
public ref class ExportFontTableIterator : IEnumerator<KeyValuePair<ExportFontKey^, ExportFontInfo^>>
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..ExportFontTableIterator
# See Also
ExportFontTableIterator Members
Autodesk.Revit.DB Namespace